Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/returning_to_education/sources_of_information_on_returning_to_education.html.txt.tmx
Source language: en
Languages: ga

source: Sources of information on returning to education
ga: Foinsí eolais maidir le filleadh ar oideachas

source: Many people including early school leavers, unemployed people and those who want to retrain for a new job may be interested in returning to education on a full-time or part-time basis. If you are interested in returning to education, there are a number of organisations and resources where you can get information about the courses available to you
ga: D'fhéadfadh spéis a bheith ag go leor daoine lena n-áirítear luathfhágálaithe scoile, daoine dífhostaithe, agus iad siúd atá á n-athoiliúint le haghaidh post nua filleadh ar oideachas ar bhonn lánaimseartha nó páirtaimseartha

source: Education and Training Boards (ETBs) are the main providers of adult education, through local schools and colleges
ga: Is iad Boird Oideachais agus Oiliúna (BOO) na príomhsholáthróirí oideachas aosach, trí scoileanna agus coláistí áitiúla

source: (Vocational Educational Committees (VECs) were replaced by Education and Training Boards (ETBs) on 1 July 2013.) Community education groups offer a variety of courses, catering for learners at all levels
ga: Cuireann grúpaí um oideachas pobail réimse cúrsaí ar tairiscint, a dhéanann freastal ar fhoghlaimeoirí ag gach leibhéal

source: Third-level colleges provide a wide range of courses too
ga: Ina theannta sin, cuireann coláistí tríú leibhéal réimse fairsing cúrsaí ar fáil

source: In 2014, the FÁS training division (including FÁS courses) transferred to the 16 Education and Training Boards (ETBs) which replaced VECs
ga: Aistríodh rannán oiliúna FÁS (lenar áiríodh cúrsaí FÁS) chuig na 16 Bord Oideachais agus Oiliúna (na hETBí) a tháinig in ionad na VECí

source: AONTAS (the Irish National Association of Adult Education) promotes adult education and lifelong learning
ga: Cuireann AONTAS (Cumann Náisiúnta na hÉireann um Oideachas Aosach) oideachas do dhaoine fásta agus foghlaim ar feadh an tsaoil chun cinn

source: AONTAS operates an information and referral service which aims to make the adult learner's first encounter with education as easy as possible
ga: Oibríonn AONTAS seirbhísí faisnéise agus atreorúcháin a bhfuil sé de chuspóir acu céadeispéireas an fhoghlaimeora fhásta le hoideachas bheith chomh héasca agus is féidir

source: AONTAS provides the One Step Up website to help all adults to enhance their learning by promoting access to learning opportunities
ga: Is é is aidhm do One Step Up cabhrú le gach aosach a fhoghlaim/foghlaim a fheabhsú trí rochtain ar dheiseanna oideachais a chur chun cinn

source: It provides a freephone helpline, answers to frequently asked questions and a calendar of learning events
ga: Cuireann sé líne chabhrach shaorghlao, freagraí ar cheisteanna coitianta agus féilire imeachtaí foghlama ar fáil

source: National Adult Literacy Agency
ga: An Áisíneacht Náisiúnta Litearthachta d’Aosaigh

source: The National Adult Literacy Agency (NALA) is a voluntary organisation that aims to ensure all adults with literacy difficulties have access to high quality learning opportunities
ga: Eagraíocht dheonach is ea an Áisíneacht Náisiúnta Litearthachta d’Aosaigh (NALA) a bhfuil sé de chuspóir acu a chinntiú go mbíonn rochtain ag gach duine fásta ag a bhfuil deacrachtaí litearthachta ar dheiseanna foghlama ardchaighdeáin

source: NALA can help you to improve your reading, writing or maths
ga: Féadfaidh an NALA cabhrú leat chun feabhas a chur ar do léamh, scríobh nó do mhatamaitic

source: You can learn with NALA in a group, one-to-one, online or over the phone
ga: Féadfaidh tú foghlaim leis an NALA i ngrúpa, duine ar dhuine, ar líne nó ar an nguthán

source: Qualifax is the Irish national database of all third-level and further education courses
ga: Is iad Qualifax an bunachar sonraí Éireannach de gach cúrsa tríú leibhéal agus breisoideachais

source: It provides the information you need to make informed choices about your education, training and career path
ga: Cuireann siad an fhaisnéis a theastaíonn uait ar fáil chun roghanna feasacha a dhéanamh faoi d’oideachas, oiliúint agus do chonair ghairme

source: It also provides a list of Adult Guidance Services
ga: Ina theannta sin, cuireann siad liosta ar fáil de Sheirbhísí Treorach do Dhaoine Fásta

source: Guide for mature students
ga: Treoir do mhic léinn lánfhásta

source: You can find detailed information about college requirements and supports for mature students in the Mature Student Directory of Irish Third-Level Institutions (pdf)
ga: Féadfaidh tú teacht ar fhaisnéis shonrach faoi riachtanais choláistí agus tacaíochtaí le haghaidh mic léinn lánfhásta san Eolaire do Mhic Léinn Lánfhásta d’Institiúidí Tríú Leibhéal na hÉireann (pdf)

source: National Centre for Guidance in Education
ga: An Lárionad Náisiúnta um Threoir san Oideachas vv

source: The National Centre for Guidance in Education (NCGE) is an agency of the Department of Education and Skills
ga: Is gníomhaireacht é an Lárionad Náisiúnta um Threoir san Oideachas (NCGE) de chuid na Roinne Oideachais agus Scileanna

source: Its main role is to support people providing guidance in all areas of education such as schools, colleges and adult education
ga: Tá sé freagrach as an Tionscnamh um Threoir san Oideachas Aosach atá comhdhéanta as 38 treoirthionscadal

source: It is responsible for the Adult Educational Guidance Initiative it provides personal, educational and career guidance to participants in VTOS, adult and community education programmes
ga: Cuireann gach tionscadal gairmthreoir, treoir phearsanta agus oideachais ar fáil do rannpháirtithe i gcláir SDOG, oideachais aosaigh agus pobail

source: In general, NCGE is not a guidance service for individuals but it does provide advice and information to people who wish to study or train in another EU country
ga: I gcoitinne, ní treoirsheirbhís é an NCGE do dhaoine aonair ach cuireann sé comhairle agus faisnéis ar fáil do dhaoine a bhfuil fonn orthu staidéar a dhéanamh nó oiliúint a fháil i dtír AE eile

source: For more details about adult education you should contact your local Education and Training Board
ga: Chun teacht ar thuilleadh sonraí faoi oideachas aosach, ba cheart duit teagmháil a dhéanamh le do Bhord Oideachais agus Oiliúna áitiúil

source: For information about training courses you should contact your local Intreo office or local employment services office
ga: Chun teacht ar fhaisnéis faoi chúrsaí oiliúna, ba cheart duit teagmháil a dhéanamh le d’oifig áitiúil Intreo nó d’oifig áitiúil seirbhísí fostaíochta
